{"keras_version": "2.1.6", "backend": "tensorflow", "config": [{"config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 100, 100, 1], "name": "input_1"}, "class_name": "InputLayer"}, {"config": {"strides": [1, 1], "activation": "relu", "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "same", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [5, 5], "name": "conv2d_1", "activity_regularizer": null, "filters": 32, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [5, 5], "pool_size": [5, 5], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "same", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "activation": "relu", "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "same", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [5, 5], "name": "conv2d_2", "activity_regularizer": null, "filters": 50, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [5, 5], "pool_size": [5, 5], "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "same", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "activation": "relu", "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "padding": "same", "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [5, 5], "name": "conv2d_3", "activity_regularizer": null, "filters": 80, "kernel_regularizer": null, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [5, 5], "pool_size": [5, 5], "data_format": "channels_last", "name": "max_pooling2d_3", "padding": "same", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "noise_shape": null, "name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_1", "units": 512, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"seed": null, "noise_shape": null, "name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_2", "units": 3, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}