{"keras_version": "2.1.6", "backend": "tensorflow", "config": [{"config": {"sparse": false, "name": "input_2", "batch_input_shape": [null, 100, 100, 1], "dtype": "float32"}, "class_name": "InputLayer"}, {"config": {"kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activation": "relu", "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "name": "conv2d_4", "use_bias": true, "filters": 32, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [5, 5], "padding": "same", "strides": [5, 5], "name": "max_pooling2d_4", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activation": "relu", "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "name": "conv2d_5", "use_bias": true, "filters": 50, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [5, 5], "padding": "same", "strides": [5, 5], "name": "max_pooling2d_5", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activation": "relu", "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "name": "conv2d_6", "use_bias": true, "filters": 80, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [5, 5], "padding": "same", "strides": [5, 5], "name": "max_pooling2d_6", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "rate": 0.25, "name": "dropout_3", "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_2", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "units": 512, "name": "dense_3", "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"noise_shape": null, "rate": 0.5, "name": "dropout_4", "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activation": "softmax", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_regularizer": null, "units": 3, "name": "dense_4", "use_bias": true, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}